Портал_EDT/src/InformationRegisters/Аук_ИсторияКомандАукционов/Аук_ИсторияКомандАукционов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Аук_ИсторияКомандАукционов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Данные</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>Автоматическая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Аук_КаналыВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючРодителя</name>
    <type>
      <types>CatalogRef.УБД_КлючиУникальности</types>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>EnumRef.Аук_РезультатыВыполненияКоманд</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Аукцион</name>
    <type>
      <types>CatalogRef.Аук_Аукционы</types>
    </type>
  </attributes>
  <attributes>
    <name>Команда</name>
    <type>
      <types>EnumRef.Аук_Команды</types>
    </type>
  </attributes>
  <attributes>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Аук_УчастникиАукционов</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.Аук_КонтактныеЛицаУчастниковАукционов</types>
    </type>
  </attributes>
  <dimensions>
    <name>КлючКоманды</name>
    <type>
      <types>CatalogRef.УБД_КлючиУникальности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Портал_EDT/src/CommonModules/Аук_УправлениеАукционамиВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗапуститьКонтрольСостоянияАукционовФоново() Экспорт
	
	//Аук_УправлениеАукционамиСервер.КонтрольСостоянияАукционов();
	
	Аук_УправлениеАукционамиСервер.КонтрольВыполненияКоманд();
	
	Аук_УправлениеАукционамиСервер.КонтрольСостоянияАукционов();
	
КонецПроцедуры

// Создание команды "Начать аукцион"
//
// Параметры:
//  пСткПараметры	 - Параметры
//		*Аукцион - СправочникСсылка.Аук_Аукционы
//		*Автоматическая - Булево - Признак того, что операция сформирована человеком или фоновым
// 
// Возвращаемое значение:
//   - 
//
Функция НачатьАукционСозданиеКоманды(пСткПараметры) Экспорт
	
	сткРез = НачатьАукционСозданиеКоманды_КонтрольПараметров(пСткПараметры);
	
	Если сткРез.Успех Тогда
		
		пМасАукционы = Справочники.Аук_Аукционы.АукционыОжидающиеЗапуска(пСткПараметры.Аукцион);	
		
		Если пМасАукционы.Количество() <> 0 Тогда
			
			сткПараметры = РегистрыСведений.Аук_ИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
			
			сткПараметры.Аукцион		= пСткПараметры.Аукцион;
			сткПараметры.Автоматическая = пСткПараметры.Автоматическая;
			
			Возврат Аук_УправлениеАукционамиСервер.НачатьАукцион_СозданиеКоманды(сткПараметры);
			
		Иначе
			
			Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'Нет аукционов, которые можно было бы начать'"));
			
		КонецЕсли;
		
	Иначе
		
		Возврат ЭдоОбщий._Ошибка(СтрШаблон(НСтр("ru = 'Ошибка создания команды. Причина: %1'"), сткРез.Результат));
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НачатьАукционСозданиеКоманды_КонтрольПараметров(пСткПараметры)
	
	Возврат КонтрольПараметровОбщий(пСткПараметры);
	
КонецФункции

Функция КонтрольПараметровОбщий(пСткПараметры)
	
	сткРез = Аук_УправлениеАукционамиКлиентСервер.ПроверкаДополнительныхСвойствВДанныхКомандыПоСтроке(пСткПараметры, "Аукцион");
	
	Если Не сткРез.Успех Тогда
		
		Возврат сткРез;
		
	КонецЕсли;
	
	Если Не пСткПараметры.Свойство("Автоматическая") Тогда
		
		пСткПараметры.Вставить("Автоматическая", ?(ЗначениеЗаполнено(ПараметрыСеанса.глТекПользователь)
												   И ПараметрыСеанса.глТекПользователь <> ПредопределенноеЗначение("Справочник.УБД_Пользователи.Система"), Ложь, Истина));		
		
	КонецЕсли;
	
	Возврат ЭдоОбщий._Успех();
	
КонецФункции	

#КонецОбласти
